//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2019, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************


//
// @files  PowerControlPolicy.uni
//
// String definitions for PowerControlPolicy
//

#langdef   en-US "English"    // English
#langdef   x-UEFI-AMI "x-UEFI-AMI"      // AMI Mapping Language

#string STR_SRVRMGMT_PWR_CONTROL_POLICY             #language en-US  "Power Control Policy"
                                                    #language x-UEFI-AMI  "IPMI900"
#string STR_SRVRMGMT_PWR_CONTROL_POLICY_HELP        #language en-US  "Configure how the system should respond if AC Power is lost,Reset not required as selected Power policy will be set in BMC when policy is saved "
#string STR_PWR_CONTROL_POLICY_RESTORE              #language en-US  "Power Restore"
#string STR_PWR_CONTROL_POLICY_LAST_STATE           #language en-US  "Last Power State"
#string STR_PWR_CONTROL_POLICY_DONOT_POWER          #language en-US  "Do Not PowerUp"
#string STR_PWR_CONTROL_POLICY_UNKNOWN              #language en-US  "Unknown"
#string STR_PWR_CONTROL_POLICY_UNSPECIFIED          #language en-US  "Unspecified"
#string STR_CONFIG_PWR_CONTROL_POLICY               #language en-US  "BMC Configured Power "
#string STR_CONFIG_PWR_CONTROL_POLICY_EX            #language en-US  "Control Policy"
#string STR_CONFIG_PWR_CONTROL_POLICY_VALUE         #language en-US  "Unknown"
                                                    #language x-UEFI-AMI  "IPMI901"
#string STR_PWR_CONTROL_POLICY_INFO                 #language en-US  "POWER CONTROL POLICY INFO"
#string STR_IPMI_PROTOCOL_ERROR                     #language en-US  " Error : IPMI Protocol Not Found!!! "
#string STR_PWR_CONTROL_POLICY_ERROR                #language en-US  " Power Control Policy congif command Failed !!! "


